{
  "posts": [
    {
      "createdAt": "2022-01-10T20:33:27.477Z",
      "title": "Yolanda Roob update 456",
      "img": "http://placeimg.com/640/480/sports",
      "desc": "The slim & simple Maple Gaming Keyboard from Dev Byte comes with a sleek body and 7- Color RGB LED Back-lighting for smart functionality",
      "id": "19",
      "content": "The slim & simple Maple Gaming Keyboard from Dev Byte comes with a sleek body and 7- Color RGB LED Back-lighting for smart functionality"
    },
    {
      "0": {
        "createdAt": "2022-01-10T20:33:27.477Z",
        "title": "Bài viết mới",
        "img": "http://placeimg.com/640/480/sports",
        "desc": "The slim & simple Maple Gaming Keyboard from Dev Byte comes with a sleek body and 7- Color RGB LED Back-lighting for smart functionality",
        "id": "2"
      },
      "createdAt": "2022-01-18T23:32:25.238Z",
      "title": "Bennie Moore",
      "img": "http://placeimg.com/640/480/sports",
      "desc": "Carbonite web goalkeeper gloves are ergonomically designed to give easy fit",
      "id": "21"
    },
    {
      "createdAt": "2022-01-18T09:17:36.448Z",
      "title": "David Beahan",
      "img": "http://placeimg.com/640/480/cats",
      "desc": "The Nagasaki Lander is the trademarked name of several series of Nagasaki sport bikes, that started with the 1984 ABC800J",
      "id": "22"
    },
    {
      "createdAt": "2022-01-18T19:58:18.894Z",
      "title": "Erin Herman",
      "img": "http://placeimg.com/640/480/fashion",
      "desc": "The Nagasaki Lander is the trademarked name of several series of Nagasaki sport bikes, that started with the 1984 ABC800J",
      "id": "23"
    },
    {
      "createdAt": "2022-01-18T19:25:18.728Z",
      "title": "Genevieve Upton II",
      "img": "http://placeimg.com/640/480/cats",
      "desc": "New ABC 13 9370, 13.3, 5th Gen CoreA5-8250U, 8GB RAM, 256GB SSD, power UHD Graphics, OS 10 Home, OS Office A & J 2016",
      "id": "25"
    },
    {
      "createdAt": "2022-01-10T07:26:52.549Z",
      "title": "Annie Stroman",
      "img": "http://placeimg.com/640/480/fashion",
      "desc": "Andy shoes are designed to keeping in mind durability as well as trends, the most stylish range of shoes & sandals",
      "id": "36"
    },
    {
      "createdAt": "2022-01-10T07:26:52.549Z",
      "title": "Annie Stroman",
      "img": "http://placeimg.com/640/480/fashion",
      "desc": "Andy shoes are designed to keeping in mind durability as well as trends, the most stylish range of shoes & sandals",
      "id": "-RgdmPM"
    }
  ],
  "products": [
    {
      "nameProduct": "Xbox Series S",
      "priceProduct": 2900,
      "quantityProduct": "99",
      "nameCategory": "1",
      "descProduct": "Access your favorite entertainment through apps like YouTube, Netflix, and more\nEnjoy over 100 games right out of the box with a 1 month Xbox Game Pass trial\nWatch 4K Blu-ray movies and stream 4K video on Netflix, Amazon, Hulu, Microsoft Movies & TV, and more\nPlay with friends and family near and far—sitting together on the sofa or around the world on Xbox Live, the fastest, most reliable gaming network\nXbox 1 games and accessories work together",
      "img": "http://res.cloudinary.com/dzroyn2i4/image/upload/v1645365881/images/l3fpmpxoirvrilyc6pae.jpg",
      "id": 1
    },
    {
      "nameProduct": "LG OLED C1 Series 83” Alexa Built-in 4k Smart TV (3840 x 2160), 120Hz Refresh Rate, AI-Powered 4K, Dolby Cinema, WiSA Ready, Gaming Mode (OLED83C1PUB, 2021)",
      "priceProduct": 4000,
      "quantityProduct": "45",
      "nameCategory": "2",
      "descProduct": "83\" OLED DISPLAY: Dive into action, adventure, and drama displayed across 8 million self-lit pixels on a bigger, bolder screen. The LG OLED award-winning TVs with perfect black, over a billion colors, and infinite contrast will have movie scenes jumping off the screen for viewing like no other.\nα9 GEN 4 AI PROCESSOR 4K: Picture and sound adjustment happen automatically with our best processor. The a9 Gen4 AI Processor 4K uses deep-learning algorithms to detect scenes and genres to make your content look its best no matter what or when you're watching.\nGAME OPTIMIZER: Game Optimizer gives you easier access to all your game settings, while the latest HDMI allows for fast gaming speeds. Plus, you'll get low input lag and fast response times with Auto Low-Latency Mode and HGiG.\nGOOGLE ASSISTANT & ALEXA BUILT IN: There’s no need for an extra device – just ask your TV for music, weather, news, your Amazon shopping list, and more. Plus, conveniently control your connected home and smart devices.\nHOME CINEMA EXPERIENCE: Get breathtaking picture and audio that makes you feel like you're in the action with Cinema HDR, Dolby Vision IQ & Dolby Atmos. See movies exactly how directors intended with Filmmaker Mode. And with built-in access to Netflix, Prime Video, Apple TV+, Disney+ and LG channels, your favorite content is at your fingertips.\nWiSA READY: Connecting high-fidelity speakers is easy – and wireless– with WiSA connectivity. Enjoy high-quality and immersive surround sound. Up to 5.1 Channel support.",
      "img": "http://res.cloudinary.com/dzroyn2i4/image/upload/v1645409389/images/jtenxvkbhxmqxolaeo4n.jpg",
      "id": 2
    },
    {
      "nameProduct": " Filtrete Smart Air Purifier & Air Quality Monitor for Large Rooms, up to 310 sqft, Alexa enabled, Wi-Fi Simple Setup, True HEPA Filter for Allergens,...",
      "priceProduct": 263,
      "quantityProduct": "80",
      "nameCategory": "3",
      "descProduct": "WI-FI ENABLED SMART AIR PURIFIER for large rooms (up to 310sqft), featuring a laser-based air quality sensor that detects microscopic particles in your air.  The Auto Mode function automatically adjusts fan speed when poor air quality is detected.\nALEXA ENABLED:  After linking your Alexa account to the Filtrete Smart App, you can use voice commands to interact with your air purifier.  Try \"Alexa, set the air purifier speed to auto\" or \"Alexa, what's the temperature on the air purifier?\"",
      "img": "http://res.cloudinary.com/dzroyn2i4/image/upload/v1645366425/images/dheancul4jkx6tbitpaz.jpg",
      "id": 3
    },
    {
      "nameProduct": "Medify MA-40 Air Purifier with H13 True HEPA Filter | 840 sq ft Coverage | for Allergens, Smoke, Smokers, Dust, Odors, Pollen, Pet Dander",
      "priceProduct": 241,
      "quantityProduct": "50",
      "nameCategory": "1",
      "descProduct": "Color\tWhite\nBrand\tMedify Air\nItem Dimensions LxWxH\t10.5 x 11 x 22 inches\nPower Source\tCorded Electric\nItem Weight\t15 Pounds",
      "img": "http://res.cloudinary.com/dzroyn2i4/image/upload/v1645366743/images/qcbdjohashdxzezdbxia.jpg",
      "id": 4
    },
    {
      "nameProduct": " Seagate Portable 2TB External Hard Drive Portable HDD",
      "priceProduct": 61,
      "quantityProduct": "44",
      "nameCategory": "2",
      "descProduct": "Easily store and access 2TB to content on the go with the Seagate Portable Drive, a USB external hard drive\nDesigned to work with Windows or Mac computers, this external hard drive makes backup a snap just drag and drop\nTo get set up, connect the portable hard drive to a computer for automatic recognition no software required\nThis USB drive provides plug and play simplicity with the included 18 inch USB 3.0 cable",
      "img": "http://res.cloudinary.com/dzroyn2i4/image/upload/v1645383727/images/ld5ipwombisxanksd72i.jpg",
      "id": 5
    },
    {
      "nameProduct": " Logitech C920x HD Pro Webcam, Full HD 1080p/30fps",
      "priceProduct": 190,
      "quantityProduct": "12",
      "nameCategory": "3",
      "descProduct": "Webcam comes with a 3-month XSplit VCam license and no privacy shutter. XSplit VCam lets you remove, replace and blur your background without a Green Screen.\nFull HD 1080p video calling and recording at 30 fps - You’ll make a strong impression when it counts with crisp, clearly detailed and vibrantly colored video.\nStereo audio with dual mics - Capture natural sound on calls and recorded videos.\nAdvanced capture software – Create and share video content easily with Logitech Capture.\nHD lighting adjustment and autofocus - The C920x automatically fine-tunes to the lighting conditions to produce bright, razor-sharp images even if you’re in a low-light setting.\nMic range - Up to 3 feet (1m)",
      "img": "http://res.cloudinary.com/dzroyn2i4/image/upload/v1645383796/images/fgfjemfdtkjh77ivcbjr.jpg",
      "id": 6
    },
    {
      "nameProduct": "Roku Ultra | Streaming Device HD/4K/HDR/Dolby Vision with Dolby Atmos, Bluetooth",
      "priceProduct": 99,
      "quantityProduct": "40",
      "nameCategory": "1",
      "descProduct": "Outrageously powerful: Enjoy a lightning-fast interface and channels like Sling, Hulu, Netflix, and Prime Video that launch in a snap on the fastest, most powerful Roku player ever\nOur best Wi-Fi: Enjoy fast, smooth TV streaming in any room in the house with our best Wi-Fi or choose to wire up over Ethernet\nCinematic streaming: Roku Ultra is the centerpiece of your home theater with spectacular 4K and Dolby Vision picture plus immersive Dolby Atmos sound\nFind your lost remote: Simply press the button on your streaming device and your Roku remote will play a sound\nNo more juggling remotes: Power up your TV, adjust the volume, and control your streaming device with one Roku voice remote",
      "img": "http://res.cloudinary.com/dzroyn2i4/image/upload/v1645383868/images/i2o0c94wkxahh4cvvllj.jpg",
      "id": 7
    },
    {
      "nameProduct": " Sennheiser HD 350BT Bluetooth 5.0 Wireless Headphone ",
      "priceProduct": 89,
      "quantityProduct": "33",
      "nameCategory": "2",
      "descProduct": "Bluetooth 5.0 technology for effortless, reliable connectivity including AAC and AptX Low Latency codec support\n30-hour battery life with USB-C fast charging\nIntuitive controls including Virtual Assistant button for Siri and Google Assistant\nSennheiser App support providing an equalizer, Podcast Mode and Firmware updates\nClassic Sennheiser minimalist design crafted from high-quality materials for outstanding durability\n",
      "img": "http://res.cloudinary.com/dzroyn2i4/image/upload/v1645383925/images/oseyymulxs42gm0jhftd.jpg",
      "id": 8
    },
    {
      "nameProduct": " SENNHEISER CX Plus True Wireless Earbuds - Bluetooth In-Ear Headphones",
      "priceProduct": 126,
      "quantityProduct": "6",
      "nameCategory": "3",
      "descProduct": "Superior sound, no compromise, powered by Sennheiser’s TrueResponse transducer, personalized with the built-in equalizer and Bass Boost.\nActive Noise Cancellation and Transparent Hearing to block out noise or gain awareness of external sounds at a touch in any environment.\nCustomizable Touch Controls for music and voice assistant to match individual preference for intuitive operation, along with independent earbud use.\nIPX4 splash resistance for trouble-free use while travelling, commuting or exercising.\nCompact, ergonomic design with 4 ear adapter sizes to ensure optimal comfort and a secure fit for anyone.",
      "img": "http://res.cloudinary.com/dzroyn2i4/image/upload/v1645383977/images/y8ywpv36trxd28g3ur4g.jpg",
      "id": 9
    },
    {
      "nameProduct": "Brother Genuine Cartridge TN760 High Yield Black Toner,1 Pack",
      "priceProduct": 76.89,
      "quantityProduct": "3",
      "nameCategory": "1",
      "descProduct": "Brother genuine cartridge: Brother TN 760 is a Brother genuine cartridge: that produces mono laser prints in high quality you can depend on\nYields up to 3,000 Pages: This replacement high yield black toner cartridge can print approximately 3,000 pages(1)\nSeamless integration: This professional replacement black toner cartridge creates rich blacks and is engineered to work in seamless unison with your Brother laser printer\nAmazon dash replenishment cartridge: Upon activation with your Dash eligible Brother printer, TN 760 replacement cartridges can be automatically ordered through Amazon Dash Replenishment and sent directly to your door\nFor use with brother laser printers and all in ones DCP L2550DW, HL L2350DW, HL L2370DW, HL L2370DWXL, HL L2390DW, HL L2395DW, MFC L2710DW, MFC L2750DW, MFC L2750DWXL",
      "img": "http://res.cloudinary.com/dzroyn2i4/image/upload/v1645384386/images/n4rjcibwz5kkytjdplmg.jpg",
      "id": 10
    },
    {
      "nameProduct": " Myst Ultrasonic Humidifier Mist Vaporizer With Water Filter",
      "priceProduct": 189,
      "quantityProduct": "7",
      "nameCategory": "2",
      "descProduct": "Filtered Cool and Warm Mist Humidifier- Enhanced water filtration provides clean humidity that is safe to breath while delivering cool and warm mist based on comfort levels. The humidifier for bedroom lasts up to 40 hours with a 1.2 gallon water tank and covered rooms as large as 540 square feet. Ideal for large rooms, bedrooms, nurseries, homes, offices and dorms.\nEasy to Clean and Patented No Leak Design- Simply detach the top water tank with built in handle to clean and add water. Convenient wide build allows for hands to clean all around thoroughly. Our no leak design makes sure the top water tank is fully secured to the base before allowing water to flow through.",
      "img": "http://res.cloudinary.com/dzroyn2i4/image/upload/v1645384474/images/hsawffd6xser7getqoei.jpg",
      "id": 11
    },
    {
      "nameProduct": "CINCOM Knee Massager with Heat Air Compression & Optional Heat ",
      "priceProduct": 14,
      "quantityProduct": "6",
      "nameCategory": "3",
      "descProduct": "【Compression & Heating Device】 - Designed with 2 big airbags in upper calf and lower thigh area, which works like a hand 360° covering your knee. In addition, there is a built-in infrared heating pad in the knee area. 2 heating levels are available. It features with overheating protection, the heat will be maintained after reaching the selected level, further relieve stiff joint, wake up tired muscles, improve circulation.\n【3 Modes & 3 Intensities】 - Contain multiple massage techniques that can provide kneading, squeezing and touching to meet different needs, gently but effectively relieve cold legs and knee pain, void worsening injury.",
      "img": "http://res.cloudinary.com/dzroyn2i4/image/upload/v1645384543/images/fc5rh1rb9px4jdz6qjo8.jpg",
      "id": 12
    }
  ],
  "users": [
    {
      "email": "quangvinh778891@gmail.com",
      "password": "$2a$10$VC2gGlk.UoHWD/a9CAFLqudjlqA/F7yWrvcKKEeXfxdgaBnMhaWRW",
      "username": "admin",
      "id": 1
    },
    {
      "email": "vinhlqph18160@fpt.edu.vn",
      "password": "$2a$10$691CUfq8bfqJoCGWzDAgcu0zOrpY26g3oX9Xx4mVVFYdGnZQfJFG6",
      "username": "member",
      "id": 2
    }
  ],
  "categories": [
    {
      "nameCategory": "Climate Pledge Friendly",
      "id": 1
    },
    {
      "nameCategory": "Audio & Video Accessories",
      "id": 2
    },
    {
      "nameCategory": "Cable Security Devices",
      "id": 3
    },
    {
      "nameCategory": "Computer Cable Adapters",
      "id": 4
    },
    {
      "nameCategory": "Keyboards, Mice & Accessories",
      "id": 5
    },
    {
      "nameCategory": "Monitor Accessories",
      "id": 6
    },
    {
      "nameCategory": "Scanner Accessories",
      "id": 7
    },
    {
      "nameCategory": "Uninterruptible Power Supply (UPS)",
      "id": 8
    },
    {
      "nameCategory": "USB Hubs",
      "id": 9
    },
    {
      "nameCategory": "Home & Kitchen",
      "id": 10
    }
  ],
  "carts": [
    {
      "userId": 2,
      "total": 5800,
      "status": 1,
      "products": [
        {
          "nameProduct": "Xbox Series S",
          "priceProduct": 2900,
          "quantityProduct": "99",
          "nameCategory": "1",
          "descProduct": "Access your favorite entertainment through apps like YouTube, Netflix, and more\nEnjoy over 100 games right out of the box with a 1 month Xbox Game Pass trial\nWatch 4K Blu-ray movies and stream 4K video on Netflix, Amazon, Hulu, Microsoft Movies & TV, and more\nPlay with friends and family near and far—sitting together on the sofa or around the world on Xbox Live, the fastest, most reliable gaming network\nXbox 1 games and accessories work together",
          "img": "http://res.cloudinary.com/dzroyn2i4/image/upload/v1645365881/images/l3fpmpxoirvrilyc6pae.jpg",
          "id": 1,
          "quantity": 2
        }
      ],
      "id": 1
    }
  ]
}